app/views/events/show.html.erb


						<% @event.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "event_tags" ON "tags"."id" = "event_tags"."tag_id" WHERE "event_tags"."event_id" = $1  [["event_id", 6]]