app/controllers/events_controller.rb

	def search
		@events = Event.search(params).paginate(page: params[:page], per_page: 12)
---
SELECT  "events".* FROM "events" WHERE (lower(name) LIKE '%s%' OR lower(description) LIKE '%s%') LIMIT $1 OFFSET $2  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"

	def index
		if params[:location]
			@events = Event.where("start > ? AND location LIKE ?", Time.now, params[:location]).paginate(page: params[:page], per_page: 12)
---
SELECT "events".* FROM "events" WHERE (start > '2017-05-08 03:00:06.160111')
SELECT COUNT(*) FROM "events" WHERE "events"."location" = $1 AND (start > '2017-05-07')  [["location", ""]]

	def home
		#need caching
		all_events = Event.all
		@items = all_events.pluck(:name)
		@top_events =  all_events.sort_by{|e| e.rsvps_count}.last(4).reverse
		@locations = Location.all.pluck(:name)#grab_locations
		@top_tags = Tag.all.sort_by {|t| t.events_count}.last(7).reverse.map {|t| [t.events.count, t.name, t.id]}
---
SELECT "events".* FROM "events"
SELECT "events"."name" FROM "events"
SELECT "locations"."name" FROM "locations"
SELECT "tags".* FROM "tags"
SELECT COUNT(*) FROM "events" INNER JOIN "event_tags" ON "events"."id" = "event_tags"."event_id" WHERE "event_tags"."tag_id" = $1  [["tag_id", 7]]

	def top_events
		@top_events =  Event.all.sort_by{|e| e.rsvps_count}.last(10).reverse.map {|e| [e.name, e.start, e.location]}
---
SELECT "events".* FROM "events"
SELECT "locations"."name" FROM "locations"