app/controllers/event_tags_controller.rb

INSERT INTO "event_tags" ("event_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 980190962], ["tag_id", 980190962], ["created_at", 2017-05-08 03:43:40 UTC], ["updated_at", 2017-05-08 03:43:40 UTC]]
---
  def create
    @event_tag = EventTag.new(event_tag_params)

    respond_to do |format|
      if @event_tag.save

DELETE FROM "event_tags" WHERE "event_tags"."id" = $1  [["id", 980190962]]
---
  def destroy
    @event_tag.destroy

SELECT  "event_tags".* FROM "event_tags" WHERE "event_tags"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_event_tag
      @event_tag = EventTag.find(params[:id])