app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE ("events"."start" BETWEEN $1 AND $2)  [["start", 2017-05-07 04:00:00 UTC], ["start", 2017-05-08 03:59:59 UTC]]
---
    def top_events_on_day
        # for alexa and other chat bots as well as future integration with other apps
        date = params[:date].to_date.strftime('%m-%d-%Y').to_date
        @top_events = Event.where(start: date.beginning_of_day..date.end_of_day) if date.present?