app/controllers/events_controller.rb

SELECT "events"."location" FROM "events"
---
	def index
		if params[:format]
			@events = Event.where(location: params[:format]).paginate(page: params[:page], per_page: 9)
		elsif params[:date]
			@events = filter_dates(params[:date])
		else
			@events = Event.paginate(page: params[:page], per_page: 9)