app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests"
---
  def index
    @interests = Interest.all

INSERT INTO "interests" ("user_id", "tag_id", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 254219264], ["tag_id", 980190962], ["rank", 1], ["created_at", 2017-05-08 03:43:42 UTC], ["updated_at", 2017-05-08 03:43:42 UTC]]
---
  def create
    @interest = Interest.new(interest_params)

    respond_to do |format|
      if @interest.save

UPDATE "interests" SET "user_id" = $1, "updated_at" = $2 WHERE "interests"."id" = $3  [["user_id", 254219264], ["updated_at", 2017-05-08 03:43:42 UTC], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @interest.update(interest_params)

DELETE FROM "interests" WHERE "interests"."id" = $1  [["id", 980190962]]
---
  def destroy
    @interest.destroy

SELECT  "interests".* FROM "interests" WHERE "interests"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_interest
      @interest = Interest.find(params[:id])