app/controllers/rsvps_controller.rb

  def rsvp
    @event = Event.find(rsvp_params[:event_id])
    @event_id = @event.id
    @rsvps = current_user.rsvps
    @choice = rsvp_params[:choice]

    if has_rsvp?
      if @preexisting.choice == @choice.to_i
        @preexisting.delete
      else
        @preexisting.update(rsvp_params)
      end
    else
      Rsvp.create(rsvp_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "rsvps" ("user_id", "event_id", "choice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["event_id", 6], ["choice", 1], ["created_at", 2017-05-08 03:00:11 UTC], ["updated_at", 2017-05-08 03:00:11 UTC]]